#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform/notejam-tf relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/notejam/notejam/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/notejam/notejam

To view this run in a browser, visit:
https://app.terraform.io/app/notejam/notejam/runs/run-PRaocxPstJhaECkh

Waiting for the plan to start...

Terraform v0.14.8
Configuring remote state backend...
Initializing Terraform configuration...
tls_private_key.bastian_ssh: Refreshing state... [id=6512ea7bb2f0b46360a668a2c7233ecfcf6ab734]
module.app-cluster.random_id.log_analytics_workspace_name_suffix: Refreshing state... [id=PclsvXTaEeU]
azurerm_resource_group.rg_hub: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-hub-network]
module.app-datbase-server.azurerm_resource_group.rg_db: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-notejam-db]
azurerm_resource_group.rg_acr: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-acr]
azurerm_resource_group.rg_spoke: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-app]
module.app-cluster.azurerm_resource_group.k8s: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-app]
azurerm_container_registry.acr-nodejan: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-acr/providers/Microsoft.ContainerRegistry/registries/acrnoedjam]
module.app-cluster.azurerm_log_analytics_workspace.notejam: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-app/providers/Microsoft.OperationalInsights/workspaces/ws-notejam-4452209267597513189]
azurerm_network_security_group.app_nsg: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-app/providers/Microsoft.Network/networkSecurityGroups/appSecurityGroup]
azurerm_virtual_network.app_vnet: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-app/providers/Microsoft.Network/virtualNetworks/spokeVirtualNetwork]
module.app-datbase-server.azurerm_mysql_server.mysqlserver: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-notejam-db/providers/Microsoft.DBforMySQL/servers/nordcloud-mysqlserver]
random_id.randomId: Refreshing state... [id=Hvle0QLFeH8]
azurerm_storage_account.nordcloudstorageaccount: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-hub-network/providers/Microsoft.Storage/storageAccounts/diag1ef95ed102c5787f]
azurerm_network_security_group.ssh-80-8080: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-hub-network/providers/Microsoft.Network/networkSecurityGroups/bastian-jenkins-sg]
azurerm_virtual_network.hub_vnet: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-hub-network/providers/Microsoft.Network/virtualNetworks/hubVirtualNetwork]
azurerm_network_security_group.hub_nsg: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-hub-network/providers/Microsoft.Network/networkSecurityGroups/hubSecurityGroup]
azurerm_public_ip.bastian_public_ip: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-hub-network/providers/Microsoft.Network/publicIPAddresses/bastianPubIP]
azurerm_virtual_network_peering.HubToSpoke1: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-hub-network/providers/Microsoft.Network/virtualNetworks/hubVirtualNetwork/virtualNetworkPeerings/peerHtoS]
azurerm_virtual_network_peering.Spoke1ToHub: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-app/providers/Microsoft.Network/virtualNetworks/spokeVirtualNetwork/virtualNetworkPeerings/peerStoH]
azurerm_network_security_rule.allow8080: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-hub-network/providers/Microsoft.Network/networkSecurityGroups/bastian-jenkins-sg/securityRules/HTTP_8080]
azurerm_network_security_rule.allow80: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-hub-network/providers/Microsoft.Network/networkSecurityGroups/bastian-jenkins-sg/securityRules/HTTP_80]
module.app-db.azurerm_mysql_database.db: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-notejam-db/providers/Microsoft.DBforMySQL/servers/nordcloud-mysqlserver/databases/dbnotejam]
module.test-db.azurerm_mysql_database.db: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-notejam-db/providers/Microsoft.DBforMySQL/servers/nordcloud-mysqlserver/databases/testdbnotejam]
azurerm_network_interface.bastian_nic: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-hub-network/providers/Microsoft.Network/networkInterfaces/bastianNIC]
azurerm_role_assignment.acr-nodejan: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-acr/providers/Microsoft.ContainerRegistry/registries/acrnoedjam/providers/Microsoft.Authorization/roleAssignments/70359c31-cb25-359e-7be3-24ac9f87f24b]
azurerm_network_interface_security_group_association.nsg_associate: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-hub-network/providers/Microsoft.Network/networkInterfaces/bastianNIC|/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-hub-network/providers/Microsoft.Network/networkSecurityGroups/bastian-jenkins-sg]
module.app-cluster.azurerm_log_analytics_solution.notejam: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourcegroups/rg-app/providers/Microsoft.OperationsManagement/solutions/ContainerInsights(ws-notejam-4452209267597513189)]
module.app-cluster.azurerm_kubernetes_cluster.k8s: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourcegroups/rg-app/providers/Microsoft.ContainerService/managedClusters/aks-notejam]
azurerm_linux_virtual_machine.bastian_jenkins_vm: Refreshing state... [id=/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-hub-network/providers/Microsoft.Compute/virtualMachines/bastjenknc]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_resource_group.app_rg will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_resource_group" "app_rg"  {
      ~ id       = "/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-app" -> (known after apply)
      ~ location = "eastus" -> (known after apply)
        name     = "rg-app"
      ~ tags     = {
          - "environment" = "nordcloud notejam test"
        } -> (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # data.azurerm_subnet.bastian-subnet will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_subnet" "bastian-subnet"  {
      ~ address_prefix                                 = "10.0.1.0/24" -> (known after apply)
      ~ address_prefixes                               = [
          - "10.0.1.0/24",
        ] -> (known after apply)
      ~ enforce_private_link_endpoint_network_policies = false -> (known after apply)
      ~ enforce_private_link_service_network_policies  = false -> (known after apply)
      ~ id                                             = "/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-hub-network/providers/Microsoft.Network/virtualNetworks/hubVirtualNetwork/subnets/hub_bastian" -> (known after apply)
        name                                           = "hub_bastian"
      + network_security_group_id                      = (known after apply)
      + route_table_id                                 = (known after apply)
      ~ service_endpoints                              = [] -> (known after apply)
        # (2 unchanged attributes hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # data.azurerm_virtual_network.app_vnet will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_virtual_network" "app_vnet"  {
      ~ address_space       = [
          - "10.0.4.0/22",
        ] -> (known after apply)
      ~ dns_servers         = [] -> (known after apply)
      ~ guid                = "226686a2-786d-4e29-b1c4-c28c13007b21" -> (known after apply)
      ~ id                  = "/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-app/providers/Microsoft.Network/virtualNetworks/spokeVirtualNetwork" -> (known after apply)
      ~ location            = "eastus" -> (known after apply)
        name                = "spokeVirtualNetwork"
      ~ subnets             = [
          - "ingress_subnet",
          - "kube_node_subnet",
        ] -> (known after apply)
      ~ vnet_peerings       = {} -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # data.azurerm_virtual_network.hub_vnet will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_virtual_network" "hub_vnet"  {
      ~ address_space       = [
          - "10.0.0.0/22",
        ] -> (known after apply)
      ~ dns_servers         = [] -> (known after apply)
      ~ guid                = "412d243d-ac28-4770-9653-605ba5f38757" -> (known after apply)
      ~ id                  = "/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-hub-network/providers/Microsoft.Network/virtualNetworks/hubVirtualNetwork" -> (known after apply)
      ~ location            = "eastus" -> (known after apply)
        name                = "hubVirtualNetwork"
      ~ subnets             = [
          - "hub_bastian",
          - "hub_subnet_fwall",
        ] -> (known after apply)
      ~ vnet_peerings       = {
          - "peerHtoS" = "/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-app/providers/Microsoft.Network/virtualNetworks/spokeVirtualNetwork"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_network_ddos_protection_plan.notejamprotect will be created
  + resource "azurerm_network_ddos_protection_plan" "notejamprotect" {
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "nordddosprotect"
      + resource_group_name = "rg-app"
      + tags                = {
          + "environment" = "nordcloud notejam test"
        }
      + virtual_network_ids = (known after apply)
    }

  # azurerm_network_interface.bastian_nic will be updated in-place
  ~ resource "azurerm_network_interface" "bastian_nic" {
        id                            = "/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-hub-network/providers/Microsoft.Network/networkInterfaces/bastianNIC"
        name                          = "bastianNIC"
        tags                          = {
            "environment" = "nordcloud notejam test"
        }
        # (11 unchanged attributes hidden)

      ~ ip_configuration {
            name                          = "bastianNICConfiguration"
          ~ subnet_id                     = "/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-hub-network/providers/Microsoft.Network/virtualNetworks/hubVirtualNetwork/subnets/hub_bastian" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # azurerm_network_security_group.app_nsg must be replaced
-/+ resource "azurerm_network_security_group" "app_nsg" {
      ~ id                  = "/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-app/providers/Microsoft.Network/networkSecurityGroups/appSecurityGroup" -> (known after apply)
      ~ location            = "eastus" -> (known after apply) # forces replacement
        name                = "appSecurityGroup"
      ~ security_rule       = [] -> (known after apply)
        tags                = {
            "environment" = "nordcloud notejam test"
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_network_security_group.ssh-80-8080 will be updated in-place
  ~ resource "azurerm_network_security_group" "ssh-80-8080" {
        id                  = "/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-hub-network/providers/Microsoft.Network/networkSecurityGroups/bastian-jenkins-sg"
        name                = "bastian-jenkins-sg"
      ~ security_rule       = [
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "22"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "SSH"
              - priority                                   = 1001
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "8080"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "Port_8080"
              - priority                                   = 1011
              - protocol                                   = "TCP"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = null
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "SSH"
              + priority                                   = 1001
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
        tags                = {
            "environment" = "nordcloud notejam test"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_network_security_rule.allow80 will be created
  + resource "azurerm_network_security_rule" "allow80" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "HTTP_80"
      + network_security_group_name = "bastian-jenkins-sg"
      + priority                    = 1003
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-hub-network"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.allow8080 will be created
  + resource "azurerm_network_security_rule" "allow8080" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "8080"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "HTTP_8080"
      + network_security_group_name = "bastian-jenkins-sg"
      + priority                    = 1002
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-hub-network"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_resource_group.rg_spoke will be updated in-place
  ~ resource "azurerm_resource_group" "rg_spoke" {
        id       = "/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-app"
        name     = "rg-app"
      ~ tags     = {
          + "environment" = "nordcloud notejam test"
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_virtual_network.app_vnet must be replaced
-/+ resource "azurerm_virtual_network" "app_vnet" {
      - dns_servers           = [] -> null
      ~ guid                  = "226686a2-786d-4e29-b1c4-c28c13007b21" -> (known after apply)
      ~ id                    = "/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-app/providers/Microsoft.Network/virtualNetworks/spokeVirtualNetwork" -> (known after apply)
      ~ location              = "eastus" -> (known after apply) # forces replacement
        name                  = "spokeVirtualNetwork"
      ~ subnet                = [
          - {
              - address_prefix = "10.0.4.0/24"
              - id             = "/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-app/providers/Microsoft.Network/virtualNetworks/spokeVirtualNetwork/subnets/ingress_subnet"
              - name           = "ingress_subnet"
              - security_group = ""
            },
          - {
              - address_prefix = "10.0.5.0/24"
              - id             = "/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-app/providers/Microsoft.Network/virtualNetworks/spokeVirtualNetwork/subnets/kube_node_subnet"
              - name           = "kube_node_subnet"
              - security_group = ""
            },
            # (2 unchanged elements hidden)
        ]
        tags                  = {
            "environment" = "nordcloud notejam test"
        }
        # (3 unchanged attributes hidden)

      + ddos_protection_plan {
          + enable = true
          + id     = (known after apply)
        }
    }

  # azurerm_virtual_network.hub_vnet will be updated in-place
  ~ resource "azurerm_virtual_network" "hub_vnet" {
        id                    = "/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-hub-network/providers/Microsoft.Network/virtualNetworks/hubVirtualNetwork"
        name                  = "hubVirtualNetwork"
        tags                  = {
            "environment" = "nordcloud notejam test"
        }
        # (7 unchanged attributes hidden)

      + ddos_protection_plan {
          + enable = true
          + id     = (known after apply)
        }
    }

  # azurerm_virtual_network_peering.HubToSpoke1 must be replaced
-/+ resource "azurerm_virtual_network_peering" "HubToSpoke1" {
      ~ allow_forwarded_traffic      = false -> (known after apply)
      ~ allow_gateway_transit        = false -> (known after apply)
      ~ id                           = "/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-hub-network/providers/Microsoft.Network/virtualNetworks/hubVirtualNetwork/virtualNetworkPeerings/peerHtoS" -> (known after apply)
        name                         = "peerHtoS"
      ~ remote_virtual_network_id    = "/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-app/providers/Microsoft.Network/virtualNetworks/spokeVirtualNetwork" -> (known after apply) # forces replacement
      ~ use_remote_gateways          = false -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # azurerm_virtual_network_peering.Spoke1ToHub must be replaced
-/+ resource "azurerm_virtual_network_peering" "Spoke1ToHub" {
      ~ allow_forwarded_traffic      = false -> (known after apply)
      ~ allow_gateway_transit        = false -> (known after apply)
      ~ id                           = "/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-app/providers/Microsoft.Network/virtualNetworks/spokeVirtualNetwork/virtualNetworkPeerings/peerStoH" -> (known after apply)
        name                         = "peerStoH"
      ~ remote_virtual_network_id    = "/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourceGroups/rg-hub-network/providers/Microsoft.Network/virtualNetworks/hubVirtualNetwork" -> (known after apply) # forces replacement
      ~ use_remote_gateways          = false -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.app-cluster.azurerm_kubernetes_cluster.k8s will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "k8s" {
        id                              = "/subscriptions/81432554-220c-405f-9b16-8c1ef66ecfe5/resourcegroups/rg-app/providers/Microsoft.ContainerService/managedClusters/aks-notejam"
        name                            = "aks-notejam"
        tags                            = {
            "environment" = "nordcloud notejam test"
        }
        # (20 unchanged attributes hidden)

      ~ addon_profile {

          - kube_dashboard {
              - enabled = false -> null
            }

            # (1 unchanged block hidden)
        }





        # (5 unchanged blocks hidden)
    }

Plan: 7 to add, 5 to change, 4 to destroy.

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Resources: 2 of 17 estimated
           $118.795999999999999872/mo +$0.0
```
</details>
*Pusher: @st185229, Action: `pull_request`*